[{"_id":"2c19ee89-2597-4c07-af43-ee7e987ebfd7","name":"Kerjakan Tugas Bahasa Inggris","classroomId":"ab17e37a-54e6-4e07-857d-461024b80bd6","mapel":"B Ingris","content":"<p><strong>Soal Bahasa Inggris Kelas XI SMA Beserta Jawaban.</strong>&nbsp;Kali ini saya akan mencoba membagikan kumpulan soal-soal yang dipelajari di kelas XI SMA. Soal-soal berikut ini terdiri dari 25 pertanyaan berupa multiple choice yang saya gabungkan dari berbagai model soal. Disini kamu juga bisa mendapatkan kunci jawaban dari soal-soal tersebut yang mana untuk melihat kunci jawabannya kamu bisa mengklik tombol paling bawah.</p><p><br></p><p><img src=\"https://4.bp.blogspot.com/-jgmBy9gg0ms/V4z0A28wxsI/AAAAAAAAG94/YoVGW6cWtW0EYlsMmqA52S_L_RI1on4GwCLcB/s1600/SoalKelasXI.png\"></p><p><br></p><p><strong>Answer the following questions correctly and carefully by choosing (A,B,C, D Or E)!</strong></p><p><strong>Choose the suitable expression to complete the short dialogue number 1 to 5.</strong></p><p>1. Dimas&nbsp;&nbsp;&nbsp;: Would you accompany me to the internet?</p><p>&nbsp;&nbsp;&nbsp;Bonar&nbsp;&nbsp;&nbsp;: ……………………..</p><p>&nbsp;&nbsp;&nbsp;Dimas&nbsp;&nbsp;&nbsp;: Thanks. I really appreciate it.</p><p>A. I’m disappointed</p><p>B. I’m not so sure</p><p>C. Sure</p><p>D. Not at all</p><p>E. I don’t know</p><p><br></p><p>2. Boni&nbsp;&nbsp;&nbsp;: How was your trip to Nias?</p><p>&nbsp;&nbsp;&nbsp;Yudha&nbsp;: ……………. with it. I want to go there again next year.</p><p>A. I’m very pleased</p><p>B. I’m really disappointed</p><p>C. I’m very displeased</p><p>D. I’m very unsatisfied</p><p>E. I’m not happy</p><p><br></p><p>3. Bella&nbsp;:&nbsp;What do you think of the book?</p><p>&nbsp;&nbsp;&nbsp;Ajeng&nbsp;: …………….. I really love it</p><p>A. It’s terrific</p><p>B. It’s disappointed</p><p>C. It’s very unsatisfying</p><p>D. It’s horrible</p><p>E. It’s displeasing</p><p><br></p><p>4. Dona&nbsp;:&nbsp;<strong><u>I think the government should give more attention to the education.</u></strong></p><p>&nbsp;&nbsp;&nbsp;Norman&nbsp;: I think so. Because the school fee is too expensive for the poor to pay.</p><p>The underlined words are used to express ….</p><p>A. Offer</p><p>B. Surprise</p><p>C. Opinion</p><p>D. Pleasure</p><p>E. Agreement</p><p><br></p><p>5. Farah : You look very busy with your work.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;…………………………</p><p>&nbsp;&nbsp;&nbsp;Reidy : Sure. If you don’t mind. How kind you are.</p><p>A. Are you tired ?</p><p>B. Can I help you ?</p><p>C. Do you like to help me ?</p><p>D. Can you do me a favour ?</p><p>E. Would you like to help me ?</p><p><br></p><p><strong>The text for questions number 6 to 10.</strong></p><p><strong>WHY THE SKY IS HIGH</strong></p><p><strong>A long time ago, the sky was close to the earth. When you stood up and stretched your arms, you could touch it.</strong></p><p><strong>One day, a farmer brought some coconuts for his wife. His wife wanted to drink the juice inside. She knocked on of the coconuts against a rock to break open the shell</strong></p><p><strong>“That’s not the way to do it, “her husband said. “You should cut it open with a knife”</strong></p><p><strong>He gave her his bolo or jungle-knife</strong></p><p><strong>His wife raised the knife to cut the coconut shell. “crack !”. As she lifted the knife about her head it split open the sky and there was heavy rain.</strong></p><p><strong>The woman told the sky, “Will you please go a little higher? I can’t raise my knife high enough to cut this coconut shell”</strong></p><p><strong>She raised the knife over her shoulder the second time. Once again, it hit the sky and there was thunder and lightening</strong></p><p><strong>“You are still too low,” the woman said to the sky. “Please go higher.”</strong></p><p><strong>She raised the bolo a third time. It still cracked the sky. There was a typhoon, and the woman’s house was almost blown away by the fierce wind.</strong></p><p><strong>“What are you doing?” cried her husband, “Can’t you even try to open a coconut shell without causing a typhoon?”</strong></p><p><strong>“It’s not me,” his wife answered. “It’s the sky which is too low”. I need more room to use the knife.”</strong></p><p><strong>Finally, the woman became very angry. She looked up and shouted at sky. “You’d better do as I told. Otherwise I shall cut you to pieces.”</strong></p><p><strong>The clouds rose and rose and the sky went up higher and higher. That’s why it is now so high.</strong></p><p><br></p><p>6. What is the type of the text above?</p><p>A. Narrative</p><p>B. Report</p><p>C. Recount</p><p>D. Procedure</p><p>E. News items</p><p><br></p><p>7. What is the social function of the text?</p><p>A. To describe about coconut shells</p><p>B. To entertain the readers with fairy legend&nbsp;</p><p>C. To inform readers about coconut shells</p><p>D. To describe how the farmers open the coconut shells</p><p>E. To explain to readers why it’s hard to open coconut shells</p><p><br></p><p>8. Based on the text above, what made the woman get angry?</p><p>A. The sky went up too high&nbsp;</p><p>B. He husband didn’t want to help her</p><p>C. She couldn’t cut the sky into pieces</p><p>D. Her husband forbade her to crack the coconut shell open</p><p>D. The sky gave her rain, thunder, lightning, and typhoon</p><p><br></p><p>9. Which one of the following statements is NOT TRUE according to the text?</p><p>A. A bolo is a jungle knife</p><p>B. The woman tore the sky for several times.</p><p>C. A very long time ago, the sky was very low</p><p>D. The farmer broke the coconut with the knife for his wife</p><p>E. The farmer’s wife wanted to drink some coconut water</p>","_createdAt":"2022-06-25T23:47:07.906Z","_updatedAt":"2022-06-25T23:47:07.907Z","_deletedAt":"","__v":0,"id":"2c19ee89-2597-4c07-af43-ee7e987ebfd7"}]